---
kind: property
id: P:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d.Value
source: html/eb048e55-64b0-9542-49dc-3538a64efb45.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray2d.Value Property

Get the value of the property

## Syntax (C#)
```csharp
public DoubleArray Value { get; }
```